src/Enums/ТипыЗаголовковЗапроса/ТипыЗаголовковЗапроса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЗаголовковЗапроса</name>
  <enumValues>
    <name>Широта</name>
  </enumValues>
  <enumValues>
    <name>Долгота</name>
  </enumValues>
  <enumValues>
    <name>КлючСервиса</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/НаселенныеПункты/НаселенныеПункты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НаселенныеПункты</name>
  <predefined>
    <items>
      <name>Москва</name>
      <description>Москва</description>
    </items>
  </predefined>
  <attributes>
    <name>Широта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Долгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачальноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Сервисы/Сервисы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сервисы</name>
  <predefined>
    <items>
      <name>OpenWeather</name>
      <description>OpenWeather</description>
    </items>
  </predefined>
  <attributes>
    <name>СтрокаЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКТемпературе</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачальноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыЗапроса</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПараметра</name>
      <type>
        <types>EnumRef.ТипыЗаголовковЗапроса</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаголовкиЗапроса</name>
    <attributes>
      <name>ИмяЗаголовка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеЗаголовка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПараметра</name>
      <type>
        <types>EnumRef.ТипыЗаголовковЗапроса</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonModules/НачальноеЗаполнение/Module.bsl
Процедура ЗаполнитьПредопределенныеНаселенныеПункты() Экспорт
	
	ГородМосква = ПредопределенноеЗначение("Справочник.НаселенныеПункты.Москва");

	Если ГородМосква.НачальноеЗаполнение Тогда
		Возврат;
	КонецЕсли; 
	
	НаселенныеПункты = ПолучитьОбщийМакет("НаселенныеПункты");
	ОбластьМосква = НаселенныеПункты.ПолучитьОбласть("Москва");
	
	УстановитьПривилегированныйРежим(Истина);
	
		ОбъектМосква = ГородМосква.ПолучитьОбъект();
		ОбластьШирота = ОбластьМосква.ПолучитьОбласть("Широта");
		ОбъектМосква.Широта = Число(ОбластьШирота.Область(1,1).Текст);
		ОбластьДолгота = ОбластьМосква.ПолучитьОбласть("Долгота");
		ОбъектМосква.Долгота = Число(ОбластьДолгота.Область(1,1).Текст);
		ОбъектМосква.НачальноеЗаполнение = Истина;
		ОбъектМосква.Записать();
		
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

Процедура ЗаполнитьПредопределенныеСервисы() Экспорт
	
	СервисЯндекс = ПредопределенноеЗначение("Справочник.Сервисы.OpenWeather");
	
	Если СервисЯндекс.НачальноеЗаполнение Тогда
		Возврат;
	КонецЕсли; 
	
	ПреднастроенныеСервисы = ПолучитьОбщийМакет("ПреднастроенныеСервисы");
	ОбластьЯндексПогода = ПреднастроенныеСервисы.ПолучитьОбласть("OpenWeather");
	
	УстановитьПривилегированныйРежим(Истина);
	
		ОбъектЯндексПогода = СервисЯндекс.ПолучитьОбъект();
		ОбластьСтрокаЗапроса = ОбластьЯндексПогода.ПолучитьОбласть("СтрокаЗапроса");
		ОбъектЯндексПогода.СтрокаЗапроса = ОбластьСтрокаЗапроса.Область(1,1).Текст;
		
		ОбластьПараметрыЗапроса = ОбластьЯндексПогода.Области.ПараметрыЗапроса;
		
		Для НомерСтр = ОбластьПараметрыЗапроса.Верх По ОбластьПараметрыЗапроса.Низ Цикл
			СтрокаПараметров = ОбъектЯндексПогода.ПараметрыЗапроса.Добавить();
			СтрокаПараметров.ИмяПараметра = ОбластьЯндексПогода.Область(НомерСтр, 1).Текст;
			СтрокаПараметров.ЗначениеПараметра = ОбластьЯндексПогода.Область(НомерСтр, 2).Текст;
			ТекстТипаЗаголовкаЗапроса = ОбластьЯндексПогода.Область(НомерСтр, 3).Текст;
			Если ТекстТипаЗаголовкаЗапроса <> "" Тогда
				СтрокаПараметров.ТипПараметра = ПредопределенноеЗначение("Перечисление.ТипыЗаголовковЗапроса."+ТекстТипаЗаголовкаЗапроса);
			КонецЕсли; 
		КонецЦикла;
		
		ОбластьЗаголовкиЗапроса = ОбластьЯндексПогода.Области.ЗаголовкиЗапроса;
		
		Для НомерСтр = ОбластьЗаголовкиЗапроса.Верх По ОбластьЗаголовкиЗапроса.Низ Цикл
			СтрокаЗаголовков = ОбъектЯндексПогода.ЗаголовкиЗапроса.Добавить();
			СтрокаЗаголовков.ИмяЗаголовка = ОбластьЯндексПогода.Область(НомерСтр, 1).Текст;
			СтрокаЗаголовков.ЗначениеЗаголовка = ОбластьЯндексПогода.Область(НомерСтр, 2).Текст;
			ТекстТипаЗаголовкаЗапроса = ОбластьЯндексПогода.Область(НомерСтр, 3).Текст;
			Если ТекстТипаЗаголовкаЗапроса <> "" Тогда
				СтрокаЗаголовков.ТипПараметра = ПредопределенноеЗначение("Перечисление.ТипыЗаголовковЗапроса."+ТекстТипаЗаголовкаЗапроса);
			КонецЕсли; 
		КонецЦикла;
		
		ОбластьПутьКТемпературе = ОбластьЯндексПогода.ПолучитьОбласть("ПутьКТемпературе");
		ОбъектЯндексПогода.ПутьКТемпературе = ОбластьПутьКТемпературе.Область(1,1).Текст;
		ОбъектЯндексПогода.НачальноеЗаполнение = Истина;
		ОбъектЯндексПогода.Записать();
		
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
